In [2]:
import pandas as pd

In [1]:
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35, 'shirts': 15, 'shoes':8, 'suits':45},
{'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5, 'shirts': 2, 'shoes':5, 'suits':7},
{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4, 'shoes':10}]

In [4]:
stores = pd.DataFrame(data= items2, index= ['store 1', 'store 2', 'store 3'] )

In [5]:
stores

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

In [6]:
# 컬럼 이름 바꾸기
# rename( columns = { 'original name' : '바꿀 이름'} )
# rename( index = { 'original name' : '바꿀 이름'} )
# 여기서 바꿀 이름은 딕셔너리 형태로 하면 된다
stores.rename( index = { 'store 1' : 'store A'} )

         bikes  pants  watches  shirts  shoes  suits  glasses
store A     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

In [7]:
stores

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

In [8]:
stores.rename( columns= { 'bikes' : 'BKS'} )

         BKS  pants  watches  shirts  shoes  suits  glasses
store 1   20     30       35    15.0      8   45.0      NaN
store 2   15      5       10     2.0      5    7.0     50.0
store 3   20     30       35     NaN     10    NaN      4.0

In [9]:
#여러개르 바꿀 때는 딕셔너리 형태에 Key: value, key: value, ... 추가하면 됨
stores.rename( columns= { 'bikes' : 'bks', 'glasses': 'gss'} )

         bks  pants  watches  shirts  shoes  suits   gss
store 1   20     30       35    15.0      8   45.0   NaN
store 2   15      5       10     2.0      5    7.0  50.0
store 3   20     30       35     NaN     10    NaN   4.0

In [10]:
# 인덱스(row)의 이름 설정
# set_index( '컬럼명' )
# set_index()는 하나의 컬럼이 대표 인덱스가 된다고 보면 됨
# 예를 들어 'pant' 컬럼을 set_index('pants')라고 하며
# pants 컬럼이 인덱스쪽으로 옮겨와 지는 것을 확인할 수 있음

stores.set_index('pants')

       bikes  watches  shirts  shoes  suits  glasses
pants
30        20       35    15.0      8   45.0      NaN
5         15       10     2.0      5    7.0     50.0
30        20       35     NaN     10    NaN      4.0

In [12]:
stores.set_index('pants', inplace=True)

In [16]:
#다시 되돌리기
# reset_index() 메소드
# index(row)를 초기화 해줌
# 컴퓨터 index 방식으로 바뀜  (0, 1, 2,...)
# 역시 메모리 반영은 안되기 때문에 inplace=True args로 넘겨야 한다
stores.reset_index(inplace=True)

In [17]:
stores

   pants  bikes  watches  shirts  shoes  suits  glasses
0     30     20       35    15.0      8   45.0      NaN
1      5     15       10     2.0      5    7.0     50.0
2     30     20       35     NaN     10    NaN      4.0

In [18]:
# isna() 
# NaN 계산- True/False
stores.isna()

   pants  bikes  watches  shirts  shoes  suits  glasses
0  False  False    False   False  False  False     True
1  False  False    False   False  False  False    False
2  False  False    False    True  False   True    False

In [19]:
# isna() 결과에 sun()을 해주면 컬럼별 NaN데이터의 합을 볼 수 있음
stores.isna().sum()

pants      0
bikes      0
watches    0
shirts     1
shoes      0
suits      1
glasses    1
dtype: int64

In [20]:
#여기에 또 sum()을 하면 NaN이 있는 컬럼에서의 총 수를 리턴해 줌
stores.isna().sum().sum()

3

In [21]:
# 반대의 경우 
# notnull()
# NaN인 아닌 경우에 True를 반환/ False
stores.notnull()

   pants  bikes  watches  shirts  shoes  suits  glasses
0   True   True     True    True   True   True    False
1   True   True     True    True   True   True     True
2   True   True     True   False   True  False     True

In [22]:
# isna()와 비교
stores.isna()

   pants  bikes  watches  shirts  shoes  suits  glasses
0  False  False    False   False  False  False     True
1  False  False    False   False  False  False    False
2  False  False    False    True  False   True    False

In [23]:
# 원래 스토어 데이터프레임
# 비교
stores

   pants  bikes  watches  shirts  shoes  suits  glasses
0     30     20       35    15.0      8   45.0      NaN
1      5     15       10     2.0      5    7.0     50.0
2     30     20       35     NaN     10    NaN      4.0

In [24]:
# 기본적으로 행으로 axis=0 으로 지우기
#  dropna() 
# NaN 이 있는 행은 지운다
stores.dropna()

   pants  bikes  watches  shirts  shoes  suits  glasses
1      5     15       10     2.0      5    7.0     50.0

In [26]:
# NaN 이 있는 컬럼 지우기 
# axis = 1
stores.dropna(axis = 1)

   pants  bikes  watches  shoes
0     30     20       35      8
1      5     15       10      5
2     30     20       35     10

In [27]:
# 특정 값 (숫자, 문자)로 NaN자리 채우기
# fillna()
# 0으로 채우기
stores.fillna(0)

   pants  bikes  watches  shirts  shoes  suits  glasses
0     30     20       35    15.0      8   45.0      0.0
1      5     15       10     2.0      5    7.0     50.0
2     30     20       35     0.0     10    0.0      4.0

In [28]:
stores.fillna('없음')

   pants  bikes  watches shirts  shoes suits glasses
0     30     20       35     15      8    45      없음
1      5     15       10      2      5     7      50
2     30     20       35     없음     10    없음       4

In [32]:
# 평균값을 넣는 방식도 사용한다고 함
stores.fillna( stores.mean() )

   pants  bikes  watches  shirts  shoes  suits  glasses
0     30     20       35    15.0      8   45.0     27.0
1      5     15       10     2.0      5    7.0     50.0
2     30     20       35     8.5     10   26.0      4.0

In [33]:
# fillna()에서 method='ffill' 또는 'bfill' 을 axis와 같이 사용할 수 있음
# method='ffill'은 forward fill 이고 
# 다음의 데이터로 넣어 준다 (axis=0으로 하면 위쪽 행(row)의 데이터를 넣음)
# 다음의 데이터로 넣어 준다 (axis=1으로 하면 왼쪽 열(column)의 데이터를 넣음)
# method='bfill'은 back fill 임
# 방식은 위와 같고, 아래 또는 오른쪽 데이터 (전)
# 헛깔림, 나중에 찾아서 쓰자

stores.fillna(method= 'ffill', axis = 0)

   pants  bikes  watches  shirts  shoes  suits  glasses
0     30     20       35    15.0      8   45.0      NaN
1      5     15       10     2.0      5    7.0     50.0
2     30     20       35     2.0     10    7.0      4.0

In [34]:
stores

   pants  bikes  watches  shirts  shoes  suits  glasses
0     30     20       35    15.0      8   45.0      NaN
1      5     15       10     2.0      5    7.0     50.0
2     30     20       35     NaN     10    NaN      4.0

In [35]:
stores.fillna(method= 'ffill', axis = 1)
# 컬럼 방식으로 변경하면 2번째 행의 shirts 컬럼이 Nan에서 10.0으로 바뀜

   pants  bikes  watches  shirts  shoes  suits  glasses
0   30.0   20.0     35.0    15.0    8.0   45.0     45.0
1    5.0   15.0     10.0     2.0    5.0    7.0     50.0
2   30.0   20.0     35.0    35.0   10.0   10.0      4.0

In [38]:
stores.fillna(method= 'bfill', axis = 0)

   pants  bikes  watches  shirts  shoes  suits  glasses
0     30     20       35    15.0      8   45.0     50.0
1      5     15       10     2.0      5    7.0     50.0
2     30     20       35     NaN     10    NaN      4.0

In [40]:
Google_stock = pd.read_csv('GOOG.csv')

In [41]:
#type 확인 시 DataFrame을 알 수 있음
type(Google_stock)

pandas.core.frame.DataFrame

In [42]:
# describe()
# 숫자 데이터만 뽑아서 통계치를 알려줌
Google_stock.describe()

,Open,High,Low,Close,Adj Close,Volume
count,3313.000000,3313.000000,3313.000000,3313.000000,3313.000000,3.313000e+03
mean,380.186092,383.493740,376.519309,380.072458,380.072458,8.038476e+06
std,223.818650,224.974534,222.473232,223.853780,223.853780,8.399521e+06
min,49.274517,50.541279,47.669952,49.681866,49.681866,7.900000e+03
25%,226.556473,228.394516,224.003082,226.407440,226.407440,2.584900e+06
50%,293.312286,295.433502,289.929291,293.029114,293.029114,5.281300e+06
75%,536.650024,540.000000,532.409973,536.690002,536.690002,1.065370e+07
max,992.000000,997.210022,989.000000,989.679993,989.679993,8.276810e+07

In [44]:
# 여기서 50% 값은 중앙값이라고 한다 == median 
# numpy에서 medain() 함수로 사용할 수도 있음
Google_stock.median()

Open         2.933123e+02
High         2.954335e+02
Low          2.899293e+02
Close        2.930291e+02
Adj Close    2.930291e+02
Volume       5.281300e+06
dtype: float64

In [45]:
# DataFrame의 정보보기
# info()
# RangeIndex, Column, D타입 등을 알 수 있음
Google_stock.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3313 entries, 0 to 3312
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       3313 non-null   object
 1   Open       3313 non-null   float64
 2   High       3313 non-null   float64
 3   Low        3313 non-null   float64
 4   Close      3313 non-null   float64
 5   Adj Close  3313 non-null   float64
 6   Volume     3313 non-null   int64
dtypes: float64(5), int64(1), object(1)
memory usage: 181.3+ KB

In [46]:
#컬럼별 평균치, 표준편차
# mean(), std()
Google_stock.mean()

Open         3.801861e+02
High         3.834937e+02
Low          3.765193e+02
Close        3.800725e+02
Adj Close    3.800725e+02
Volume       8.038476e+06
dtype: float64

In [47]:
Google_stock.std()

Open         2.238187e+02
High         2.249745e+02
Low          2.224732e+02
Close        2.238538e+02
Adj Close    2.238538e+02
Volume       8.399521e+06
dtype: float64

In [48]:
df = pd.read_csv('fake_company.csv')

In [50]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Year        9 non-null      int64
 1   Name        9 non-null      object
 2   Department  9 non-null      object
 3   Age         9 non-null      int64
 4   Salary      9 non-null      int64
dtypes: int64(3), object(2)
memory usage: 488.0+ bytes

In [51]:
# 위에서 타입을 보면 Name, Department 컬럼은 object 타입, 즉 문자열인것을 알 수 있음
# 문자열 중복 사용되는 것 확인
# unique() 
df['Name'].unique()

array(['Alice', 'Bob', 'Charlie'], dtype=object)

In [52]:
df

   Year     Name Department  Age  Salary
0  1990    Alice         HR   25   50000
1  1990      Bob         RD   30   48000
2  1990  Charlie      Admin   45   55000
3  1991    Alice         HR   26   52000
4  1991      Bob         RD   31   50000
5  1991  Charlie      Admin   46   60000
6  1992    Alice         HR   27   60000
7  1992      Bob         RD   32   52000
8  1992  Charlie      Admin   47   62000

In [53]:
# groupby 로 그룹 만들기
# 컬럼의 데이터가 같은 것끼리 묶음 (즉, unique 특징인 같은 문자열)
df.groupby('Year')

In [ ]:
# Year컬럼의 내용으로 그룹이 형성 된다
# Year의 데이터는 1990, 1991, 1992 이 있어서 3개의 그룹화

In [55]:
# 여기에 그룹화 된 것에서 데이터 엑세스가 가능함
df.groupby('Year')['Salary'].mean()

Year
1990    51000
1991    54000
1992    58000
Name: Salary, dtype: int64

In [58]:
# 그룹화를 Name으로 데이터를 받아올 수 도 있다
df.groupby('Name')['Salary'].mean()

Name
Alice      54000
Bob        50000
Charlie    59000
Name: Salary, dtype: int64

In [59]:
#웹페이지에서 테이블 받아오기
# read_html()
# args로 url을 넘겨준다
pd.read_html('https://www.livingin-canada.com/house-prices-canada.html')

[                                                City  \
 0                                      Vancouver, BC
 1                                       Toronto, Ont
 2                                        Ottawa, Ont
 3                                       Calgary, Alb
 4                                      Montreal, Que
 5                                        Halifax, NS
 6                                       Regina, Sask
 7                                    Fredericton, NB
 8  (adsbygoogle = window.adsbygoogle || []).push(...

                                  Average House Price  \
 0                                         $1,036,000
 1                                           $870,000
 2                                           $479,000
 3                                           $410,000
 4                                           $435,000
 5                                           $331,000
 6                                           $254,000
 7                                           $198,000
 8  (adsbygoogle = window.adsbygoogle || []).push(...

                                      12 Month Change
 0                                           + 2.63 %
 1                                            +10.2 %
 2                                           + 15.4 %
 3                                            – 1.5 %
 4                                            + 9.3 %
 5                                            + 3.6 %
 6                                            – 3.9 %
 7                                            – 4.3 %
 8  (adsbygoogle = window.adsbygoogle || []).push(...  ,
                                              Province  \
 0                                    British Columbia
 1                                             Ontario
 2                                             Alberta
 3                                              Quebec
 4                                            Manitoba
 5                                        Saskatchewan
 6                                         Nova Scotia
 7                                Prince Edward Island
 8                             Newfoundland / Labrador
 9                                       New Brunswick
 10                                   Canadian Average
 11  (adsbygoogle = window.adsbygoogle || []).push(...

                                   Average House Price  \
 0                                            $736,000
 1                                            $594,000
 2                                            $353,000
 3                                            $340,000
 4                                            $295,000
 5                                            $271,000
 6                                            $266,000
 7                                            $243,000
 8                                            $236,000
 9                                            $183,000
 10                                           $488,000
 11  (adsbygoogle = window.adsbygoogle || []).push(...

                                       12 Month Change
 0                                             + 7.6 %
 1                                             – 3.2 %
 2                                             – 7.5 %
 3                                             + 7.6 %
 4                                             – 1.4 %
 5                                             – 3.8 %
 6                                             + 3.5 %
 7                                             + 3.0 %
 8                                             – 1.6 %
 9                                             – 2.2 %
 10                                            – 1.3 %
 11  (adsbygoogle = window.adsbygoogle || []).push(...  ]

In [60]:
df1 = pd.DataFrame({'Employee ID':[111, 222, 333, 444],
                   'Employee Name':['Chanel', 'Steve', 'Mitch', 'Bird'],
                   'Salary [$/h]':[35, 29, 38, 20],
                   'Years of Experience':[3, 4 ,9, 1]})

In [ ]:
# 상관계수 
# 컬럼간의 관계를 '상관관계''
# correlation

In [61]:
# corr()
df.corr()

            Year       Age    Salary
Year    1.000000  0.095637  0.588811
Age     0.095637  1.000000  0.632837
Salary  0.588811  0.632837  1.000000

In [63]:
# 이용해서 함수를 넘겨줄 수 있다
# 사용자 함수, 기존파이썬 내장 함수 다 가능
# apply()

df1

   Employee ID Employee Name  Salary [$/h]  Years of Experience
0          111        Chanel            35                    3
1          222         Steve            29                    4
2          333         Mitch            38                    9
3          444          Bird            20                    1

In [66]:
# 예: 이름의 길이를 구해서 새로운 컬럼 만들기
# apply()는 각 데이터에 접근해서 함수를 적용시켜주고 
# 여기서는 len함수, 그러면 len에서 길이를 구한 결과를 리턴해주면
# 그 값들을 표시해 준다
# 즉 사용자 함수에서도 데이터를 받아서 비교 분석 후 결과값을 리턴만 해주게 만들면
# apply() 메소드를 사용할 수 있음
df1['Employee Name'].apply(len)

0    6
1    5
2    5
3    4
Name: Employee Name, dtype: int64

In [1]:
import pandas as pd
df = pd.DataFrame({'Employee ID':[111, 222, 333, 444], 
                   'Employee Name':['Chanel', 'Steve', 'Mitch', 'Bird'], 
                   'Salary [$/h]':[35, 29, 38, 20], 
                   'Years of Experience':[3, 4 ,9, 1]})

In [2]:
df

   Employee ID Employee Name  Salary [$/h]  Years of Experience
0          111        Chanel            35                    3
1          222         Steve            29                    4
2          333         Mitch            38                    9
3          444          Bird            20                    1

In [5]:
# sort_values( by=)
# 기본 오름차순 정렬
# 정렬 파라미터 ascending=
df.sort_values(by= 'Salary [$/h]')

   Employee ID Employee Name  Salary [$/h]  Years of Experience
3          444          Bird            20                    1
1          222         Steve            29                    4
0          111        Chanel            35                    3
2          333         Mitch            38                    9

In [11]:
# 내림차순 정렬
# ascending=False 로 넘겨준다
df.sort_values(by = 'Employee ID', ascending=False)

   Employee ID Employee Name  Salary [$/h]  Years of Experience
3          444          Bird            20                    1
2          333         Mitch            38                    9
1          222         Steve            29                    4
0          111        Chanel            35                    3

In [12]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
index=[0, 1, 2, 3])
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
index=[4, 5, 6, 7]) 
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C8', 'C9', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']},
index=[8, 9, 10, 11])

In [13]:
# 컬럼이름이 동일한 경우에 하나로 합치기
# concat()
# 여러개일 경우에는 리스트화 해서 넘김
pd.concat( [df1, df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [17]:
# 인덱스 재정렬을 reset_index()
# reset_index()
pd.concat( [df3, df2, df1 ] ).reset_index()

    index    A    B    C    D
0       8   A8   B8   C8   D8
1       9   A9   B9   C9   D9
2      10  A10  B10  C10  D10
3      11  A11  B11  C11  D11
4       4   A4   B4   C4   D4
5       5   A5   B5   C5   D5
6       6   A6   B6   C6   D6
7       7   A7   B7   C7   D7
8       0   A0   B0   C0   D0
9       1   A1   B1   C1   D1
10      2   A2   B2   C2   D2
11      3   A3   B3   C3   D3

In [19]:
pd.concat( [df3, df2, df1 ] ).reset_index().drop('index', axis=1)

      A    B    C    D
0    A8   B8   C8   D8
1    A9   B9   C9   D9
2   A10  B10  C10  D10
3   A11  B11  C11  D11
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A0   B0   C0   D0
9    A1   B1   C1   D1
10   A2   B2   C2   D2
11   A3   B3   C3   D3

In [ ]:
# merge() 메소드
# db의 join과 비슷 
# merge() 복습 차례